import {useEffect, useState} from 'react'
import ReactWordcloud from 'react-wordcloud';

let start = 0

const COUNT = 10
const MAX = 10
const MIN = 1


function App() {
    const [words, setWords] = useState(() => vipList.map(
        (name, idx) => ({
            text: name,
            value: idx < COUNT ? MAX : MIN
        })))

    useEffect(() => {
        setTimeout(() => {
            setWords(list => {
                start = start + COUNT
                if(start > vipList.length){
                    start = 0
                }
                return list.map((item, idx) => ({text: item.text, value: start <= idx && idx < (start + COUNT) ? MAX : MIN}))
            })
        }, 7000)
    }, [words])


    const options = {
        enableOptimizations: true,
        deterministic: true,
        enableTooltip: false,
        padding: 4, // 패딩 설정 시 버그가 좀 있음.. ;;
        fontSizes: [18, 100],
        // fontWeight: 'bold',
        fontFamily: `-apple-system,BlinkMacSystemFont,"Segoe UI","Roboto","Oxygen","Ubuntu","Cantarell","Fira Sans","Droid Sans","Helvetica Neue",sans-serif`,
        rotations: 0,
    }

  return (
    <div style={{height: "100vh"}}>
      <ReactWordcloud words={words} options={options} maxWords={1000}/>
    </div>
  );
}

export default App;

const vipList = ["전정길","김영욱","강영화","성현정","이영미","이익수","","김학열","김상기","이윤아","전금진","소희정","김나나","박일곤","김희영","배은미","주경숙","곽양념","김영희","김영숙","김현숙","연인숙","김상식","김상현","김유리","안은경","안택영","김혜미","하윤후","이서원","이선숙","김영숙","김유수","김경득","이혜경","김태흥","신재숙","이동희","양미선","신광균","이범용","장춘선","김영태","김근태","김지연","하현진","김희영","김태연","혜숙","호현","김종석","전선영","윤옥희","김성혜","최경숙","김봉연","양경산","김태현","양윤서","양진서","김기한","김숙자","오외선","김정현","김정힘","김정효","바리깡원장님","지민씨","김은희","김현임","지준희","김시남","김명환","우병기","함창배","김복순","이용숙","황정식","홍의숙","김영섭","김형택","김남태","이수용","김성균","배병덕","김영석","김영용","김대현","강남미","김명순","김서연","강미숙","변성민","박상정","나연미","방금주","김인숙","장세형","이진주","장효원","장우빈","양수경","김병남","이민솔","이일정","김옥열","김충기","서미경","유정숙","김석근","송업분","김홍열","김현숙","조혜숙","김성분","김철근","윤영수","이창례","박상근","권순덕","고명희","김상일","김태현","김민주","홍영희","윤기훈","김인녀","윤종숙","박성만","최동조","이상일","이상형","이현주","한경희","이은경","배선남","이정석","배은솔","이현석","배승민","이경화","배희관","구윤희","장혜정","박현선","최영수","유지원","김해도담","이정화","이설희","신재혁","장승희","김민태","유지원","이유정\n김시윤","박혜자","이정우","김승현","정은영","김지여","김승호","푸름이형님","우리형","배형수","유혜진","나성미","배민서","최선호","윤순희","김지연","김미숙","김순남","장희경","유완준","노경애","박창숙","최점순","손진록","정명섭","정이남","정이여","정매여","정란여","정단여","이현희","조경희","김석재","정양숙","조하윤","조영은","문득준","강후남","김윤식","민수경","신덕원","603호","603호","박상경","김현선","박태순","표연희","강지우","최영미","박진우","박현모","윤선영","한선주","김학운","박득순","박청일","한민석","이한주","이미지","이해옥","이한우","정승현","이철훈","심중식","배성식","이동영","박무연","신현아","오영석","이재도","강영락","윤재호","이혜주","오청규","홍예진","이서연","홍기주","이다연","천현주","김재성","정은석","정은영","김영숙","신현숙","엄성일","김태식","김재곤","전익선","김현수","한예슬","김계훈","손순님","조미정","이정님","신진선","신태승","최윤화","신종혁","강석영","신세은","명동식당","손정숙","세탁소","프라임마트\n송춘학","정용남","이병란","서영숙","유춘영","임주호","김은아","홍승표","안수경","박동수","김금자","맹정석","양은경","강정옥","조영숙","강인기","호수엄마","강병관","박경란","엄선주","장순옥","안순옥","엄선주","홍은혜","손주형","손호형","오기홍","오종세","오종승","오종석","김권섭","정미애","전복순","인병상","선문규","정경애","오종식","민창수","임금순","김일환","유일뿐","김나현","신복녀","이선금","신순희","서은미","윤정원","구능회","구봉회","구정회","이다경","김영수","원용성","박경석","김은희","임기창","임석호","정형진","정채환","정범진","임복제","김현주","이현섭","김기수","이창우","양미선","정금선","박지혜","이덕례","박세희","우금희","박세희","유향자","송영순","안세환","안은솔","안은인","천영서","전정순","임예자","양미선","박인해","김동식","이혜경","김태경","편의점사장님","구점준","윤정자","권오용","권오숙","장경순","김연자","김용구","김대엽","김윤태","박대영","한현","한희구","한현섭","김재임","박지훈","전영식","전영준","박옥녀","백인호","강갑술","김동훈","전희정","이강수","이남수","이명희","정민숙","이숙자","최정자","조동준","김숙자","조재남","김영선","전재범","김석호","조항천","조은채","도영미","강회용","이찬형","조행천","최금화","신금자","임후현","박현숙","양현례","김영기","선미현","차재숙","강미선","선민호","함용숙","성기석","김정찬","김현미","김숙희","김승길","박정완","김승미","최태권","최순덕","이선미","김미경","조은실","최석태","박경자","최양님","최화중","김선주","박수창","이유진","구점준","한주평","한채운","홍찬우","홍정우","구택서","방건평","전재문","이승혁","황영난","이헌","최명진","김하원"]
